bakery/__init__.org
#+setupfile: ../settings/README.org
#+include: ../settings/README.org
#+property: header-args:py :tangle yes :comments both

* Bakery Frontend

Adapted from the entirety of [[https://stackoverflow.com/questions/56786604/import-modules-that-dont-exist-yet][this question]]:

** Imports

#+begin_src py
import hy
#+end_src

*** From

#+begin_src py
from shutil import which as notToBeConfusedWithWhich
#+end_src

** Relative Import

Adapted from [[https://stackoverflow.com/users/799163/remcogerlich][RemcoGerlich's]] answer [[https://stackoverflow.com/a/21139466][here]]:

#+begin_src py
from .bakery import milcery as notToBeConfusedWithMilcery
#+end_src

** Rest of __init__

#+begin_src py
def __getattr__(program_):
    if program_ == "__path__":
        raise AttributeError
    elif program_ == "steakery":
        return notToBeConfusedWithMilcery
    elif notToBeConfusedWithWhich(program_):
        return notToBeConfusedWithMilcery(program_ = program_)
    else:
        raise AttributeError
#+end_src
